# todo: Определить в коде переменные:
# 1. Целочисленного типа
# 2. Вещественного типа
# 3. Логического типа
# 4. Строкового типа
# 5. Пустого типа
# Вывести их типы.

num = 1
fl = 1.0
boolean = True
st = 'string'
null = None

print(f"type: {type(num).__name__}, type: {type(fl).__name__}, type: {type(boolean).__name__}, type: {type(st).__name__}, type: {type(null).__name__}")